custom_authentication/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "remember_token", "created_at", "updated_at", "avatar") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "rohandatta.try4@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-04-05 11:04:48.248670"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "r@r.com"], ["LIMIT", 1]]
---
  def log_in
      user = User.find_by(email: user_params[:email])