devise_authentication/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.all